{
  "plenty": [
    "The gym is open and the court is yours if you want to shoot around for a while.",
    "Plenty of time left today — you could enjoy a long, easy session whenever you're ready.",
    "There's a wide-open window right now if you feel like getting some movement in.",
    "The community center has lots of time left — a great chance to try something new if you want.",
    "No rush at all today. You can take your time getting there and still enjoy a full session.",
    "The gym is waiting whenever you are — plenty of room in the schedule to play.",
    "You've got a generous window if you want to come shoot hoops or walk the track.",
    "Lots of open time ahead — could be a nice day to explore a pickup game if you're feeling it.",
    "The doors are open and there's plenty of time to enjoy whatever kind of movement sounds good.",
    "Whenever you're ready, the gym has a big chunk of time left for you to enjoy.",
    "A long session, a short one, or anything in between — there's time for whatever feels right.",
    "The community center is humming along with plenty of availability if you want to stop by.",
    "You can take a relaxed pace today — the gym is open for a good long while still.",
    "If a pickup game or some time on the court sounds fun, there's plenty of time to make it happen.",
    "The track and the courts are open with hours to spare — come hang whenever you feel like it.",
    "Today's schedule has a nice long stretch of availability if you want to take advantage of it.",
    "There's no need to hurry — the gym has a wide window and you can show up at your own pace.",
    "If you've been meaning to get some movement in, today's a great day with lots of open time.",
    "The community center is yours for a while — plenty of time to stretch, play, or just unwind.",
    "You could fit in a full game, a relaxed walk, or both — there's time for all of it today.",
    "The gym floor is open and the clock is on your side if you feel like coming through.",
    "Sometimes it's nice to have options — and today the schedule is wide open for you.",
    "There's a comfortable amount of time left if you want to come move around and feel good.",
    "The rec center has plenty of availability — you can plan your visit without any time pressure.",
    "A few friends, a basketball, and a wide-open gym — sounds like a pretty good afternoon if you ask me.",
    "You've got lots of room in today's schedule to come enjoy some court time at your own pace.",
    "The gym is quiet and open with a long window ahead — a nice opportunity if you want it.",
    "No need to rush your day — the community center will be open for a good while still.",
    "If you want to come play, stretch, or just enjoy the space, there's plenty of time today.",
    "Today has a big open window at the gym — you can come early, come late, your call.",
    "The courts are available and the vibe is relaxed — lots of time if you feel like dropping in.",
    "Whether it's twenty minutes or two hours, there's space in the schedule for whatever you want.",
    "The community center is open and welcoming — swing by whenever the mood strikes you today.",
    "You can take your sweet time today — the gym has a long stretch of availability ahead.",
    "If you've been thinking about getting some steps in, the track is open with time to spare.",
    "A nice long window at the gym today means you can go at whatever pace feels comfortable.",
    "The rec center has hours of open time — could be a good day to reconnect with some movement.",
    "Whenever the moment feels right, the gym is there with plenty of time left on the clock.",
    "You could bring a friend, try a new routine, or just enjoy the space — lots of time today.",
    "The doors are open and the schedule is generous — come enjoy the community center if you'd like.",
    "There's a relaxed, open vibe at the gym today with plenty of availability on the schedule.",
    "If shooting around or walking the track sounds appealing, you've got a nice long window today.",
    "The gym is yours whenever you want it — no rush, no pressure, just open time ahead.",
    "Today's availability is looking great if you want to come move, play, or just be around people.",
    "A leisurely visit to the gym could feel really good today — and there's plenty of time for one.",
    "The community center has a generous stretch of open time — your visit can be whatever you want.",
    "Sometimes the best part is just showing up — and today you have all the time in the world.",
    "The gym floor, the track, the courts — they're all open with a wide window if you're interested.",
    "You can plan a visit without watching the clock today — the schedule has lots of breathing room.",
    "If you feel like moving your body and enjoying the community vibe, today has plenty of open time."
  ],
  "good": [
    "There's a nice chunk of time left at the gym — enough to get in a solid, satisfying session.",
    "The community center still has a good window open if you want to come enjoy some court time.",
    "You could fit in a really enjoyable session right now — the gym has a good stretch of availability.",
    "A good amount of time is still on the board if you feel like shooting some hoops today.",
    "The gym has a solid window left — enough time to play, stretch, and still feel unhurried.",
    "If you've been on the fence, there's a comfortable amount of time left to come through.",
    "The courts are open and there's a nice window — you could get in some quality movement.",
    "There's still a good-sized opening at the gym if you want to come walk, play, or unwind.",
    "Enough time for a real session if you're feeling it — the gym door is open for you.",
    "The community center has a healthy stretch of availability left — a good time to visit if you'd like.",
    "You can still enjoy a fulfilling visit to the gym — there's a nice amount of time remaining.",
    "A solid session is totally doable right now if movement sounds good to you today.",
    "The gym still has a good window — enough to shoot around, walk the track, and feel refreshed.",
    "If you want to come enjoy some activity, there's a comfortable pocket of time waiting for you.",
    "There's a good opening at the rec center — enough time to get into a nice rhythm.",
    "The schedule still has a satisfying window if you feel like spending some time at the gym.",
    "You could enjoy a meaningful session right now — the gym has a solid block of time open.",
    "A pickup game, some stretching, or a few laps — there's a good amount of time for any of it.",
    "The gym is open with a nice window ahead — enough to make a visit feel worthwhile and fun.",
    "There's still a rewarding amount of time at the community center if you want to come play.",
    "The courts and track are available with a solid stretch remaining — come enjoy if you'd like.",
    "If you can head over in the next little while, you'll have a nice session window at the gym.",
    "A good chunk of availability remains — enough time to really enjoy yourself at the community center.",
    "The gym has a comfortable window left — perfect for a relaxed but satisfying visit if you want.",
    "There's still time for a proper session — the community center would love to see you today.",
    "You could get in some great movement right now — the gym has a nice amount of time left.",
    "The schedule looks inviting with a good window still open for whatever activity sounds fun to you.",
    "If the gym is calling your name, there's a solid stretch of time to answer that call.",
    "A visit right now could feel really good — there's enough time for a quality session today.",
    "The rec center has a good pocket of availability — you can still come and enjoy the space.",
    "There's a nice amount of gym time remaining if you want to come move and feel energized.",
    "Enough time for some real fun at the gym — whether that's basketball, walking, or just hanging out.",
    "The community center still has a satisfying window — you could enjoy a full and varied session.",
    "If you head over soon, you'll find a good stretch of open time waiting for you at the gym.",
    "The gym's availability is in a sweet spot — enough time for something fun without feeling rushed.",
    "A solid session is still on the table if you feel like getting some enjoyable movement in.",
    "There's a good amount of gym time left — enough to make the trip feel really worthwhile.",
    "The courts are open and the window is solid — you could enjoy some quality play time today.",
    "If some time at the gym sounds nice, there's a comfortable window to fit in a good visit.",
    "You've still got a nice opportunity for a fulfilling session — the gym has good availability right now.",
    "The community center has a pleasant stretch of time left — a nice chance to come enjoy yourself.",
    "There's a good window at the gym if you want to come recharge with some movement today.",
    "A visit now gives you enough time to warm up, enjoy yourself, and leave feeling great afterward.",
    "The gym still has solid availability — enough for a session that leaves you feeling refreshed and happy.",
    "If you're thinking about it, there's a nice window — enough time for a genuinely enjoyable visit.",
    "The rec center has a good block of time left — could be a nice way to spend part of your day.",
    "There's still a good opening for some gym time if moving your body sounds appealing right now.",
    "You could fit in something really satisfying at the gym — there's a solid window still available.",
    "The community center has a good stretch ahead — enough time to play and feel good about it.",
    "A quality session is within reach if you want it — the gym has a nice window remaining."
  ],
  "winding": [
    "There's still time for a quick session if you feel like getting some movement in today.",
    "A shorter visit could still feel great — the gym has some time left if you want it.",
    "If you can head over soon, you could still enjoy a nice quick session at the gym.",
    "There's a window for a focused visit — sometimes a shorter session hits just right.",
    "The gym still has some availability if a quick stretch or a few laps sounds good to you.",
    "A brisk walk or a few shots on the court — there's still time if you're feeling it.",
    "You can still catch some gym time today if you head over in the next little while.",
    "Sometimes a compact session is the most refreshing kind — there's still a window if you want it.",
    "The community center has some time left — enough for a quick, energizing visit if you're up for it.",
    "If you want a quick mood boost, the gym is still open with a bit of time on the clock.",
    "There's still a pocket of time at the gym — a quick session could be just what you want.",
    "A focused twenty or thirty minutes at the gym can feel surprisingly good — there's still time for that.",
    "The gym has a smaller window left, but it's enough for a really satisfying quick visit.",
    "If you've been meaning to stop by, there's still a chance to fit in some fun movement.",
    "You could still enjoy a quick game or some time on the track if you head over soon.",
    "The window is getting cozier, but there's still room for a refreshing quick session at the gym.",
    "A short visit to the community center could be a nice way to break up your day.",
    "There's still time to come play for a bit — sometimes that's all it takes to feel recharged.",
    "The gym has some availability left — a quick stop could leave you feeling pleasantly energized.",
    "If a brief but satisfying session sounds good, the gym still has a window for you today.",
    "You can still get in some quality movement — the community center has a bit of time remaining.",
    "A compact visit might be exactly what sounds good right now — there's still time if you want.",
    "The courts still have some time — enough for a quick shoot-around if that appeals to you.",
    "There's a narrower window but still enough for a visit that leaves you feeling good afterward.",
    "If you feel like a quick energy boost, the gym is still available for a shorter session.",
    "Sometimes showing up for even a short while makes all the difference — the gym is still open.",
    "The community center has some remaining time — a focused visit could be a nice way to recharge.",
    "You could still squeeze in a quick and fun session if the gym sounds appealing right now.",
    "There's still an opening for some movement — even a brief visit can shift your whole mood.",
    "A quick trip to the gym could be a great call — there's still some time on the schedule.",
    "The gym window is winding down but there's still room for a quick, enjoyable visit today.",
    "If you can come by soon, you'll still have enough time for a refreshing mini session at the gym.",
    "There's a bit of time left at the community center — enough for a quick and satisfying visit.",
    "A shorter gym session can be just as rewarding — and there's still time to fit one in.",
    "The track and courts have some availability left if you want to come move for a bit.",
    "If a quick visit to the gym sounds like a nice break, there's still a window for it.",
    "You could still come enjoy some brief court time — sometimes short sessions are the sweetest ones.",
    "There's still time for a quick stop at the community center if you feel like some movement.",
    "The gym is still open with a bit of time — a focused session could be just the thing.",
    "If you want to come shoot around or take a few laps, there's still a window today.",
    "A quick visit might be calling your name — the gym has some time left if you're interested.",
    "There's enough time for a nice short session — the community center is still available for you.",
    "The gym has a smaller but still inviting window — a quick visit could brighten your day.",
    "If you act on the impulse to move, there's still a window at the gym waiting for you.",
    "Sometimes a focused thirty minutes can feel like the best part of your day — still time for that.",
    "The community center has a bit of availability left — a quick pop-in could feel really good.",
    "You can still fit in a short, sweet gym session if you head over in the next bit.",
    "There's still time for a quick energy recharge at the gym — come play if you feel like it.",
    "A brief session at the community center could be a nice gift to yourself — time is still there.",
    "The gym still has a window — if a quick visit sounds fun, you can still make it happen."
  ],
  "last": [
    "There's a little time left if you feel like a quick pop-in at the gym today.",
    "The gym is closing soon, but a quick visit could still feel good if you want to come by.",
    "If you can head over now, you could still catch a few minutes of gym time today.",
    "A quick five or ten minutes of movement might be just what you want — the gym is still open.",
    "The window is small but the door is still open if you feel like a brief visit.",
    "There's just a bit of time left — but sometimes that's all it takes to feel a little better.",
    "A quick pop-in at the community center could be a nice end to this part of your day.",
    "If you're nearby, you could still catch the tail end of gym availability for a quick visit.",
    "The gym is wrapping up soon, but there's still a moment to come enjoy if you want.",
    "Even a few minutes at the gym can feel refreshing — there's a small window left if you're interested.",
    "The community center has a little bit of time left — a quick hello to the court could be nice.",
    "If a brief burst of movement sounds appealing, the gym still has a small window open for you.",
    "There's just enough time for a quick visit if you feel the pull to come move a little.",
    "The gym is in its last stretch today — a quick stop could still be a nice moment for you.",
    "A short pop-in is still possible if you want to end this window with a bit of movement.",
    "If you can get there soon, a quick session at the gym might be a fun way to go.",
    "The availability is winding down, but a brief visit could still bring a nice energy shift.",
    "There's a tiny window left at the gym — sometimes the shortest visits are the most spontaneous fun.",
    "The community center is almost done for now, but you could still pop in for a quick moment.",
    "A quick couple of laps or a few free throws — there's just enough time if you want it.",
    "If you've been thinking about it all day, there's still a small chance to make it happen.",
    "The gym has a few minutes left — a quick visit might be a nice little treat for yourself.",
    "There's a small but real window left if a quick bit of movement sounds good right now.",
    "The clock is close to done but the gym is still open — come say hi if you feel like it.",
    "A quick trip to the community center is still on the table if you're feeling spontaneous today.",
    "Sometimes the last-minute decision to go is the best one — there's still a bit of time left.",
    "The gym is almost closing this window, but a quick pop-in is still totally possible if you want.",
    "If you're in the mood for just a few minutes of play, the gym still has a tiny opening.",
    "There's a narrow window left — but it could be just enough for a quick and fun gym moment.",
    "The community center has a sliver of time remaining — a quick visit could be a nice surprise for yourself.",
    "A spontaneous quick visit might feel really good right now — the gym has a little time left.",
    "If you want to catch the last bit of availability, you could still enjoy a brief gym stop.",
    "The gym is nearing the end of this window, but you can still make a quick visit count.",
    "There's barely enough time for a full session, but a quick pop-in could still brighten your mood.",
    "A few minutes of movement at the gym is still possible — come by if you feel like it.",
    "The schedule is almost full, but there's just enough room for a quick, spontaneous visit if you want.",
    "If you're close by, a quick trip to the gym could be a nice way to use these last minutes.",
    "The gym's window is nearly closed, but a brief visit is still an option if it sounds good.",
    "Sometimes the best gym visits are the unplanned quick ones — there's still a small moment left today.",
    "A quick dash to the community center could feel surprisingly good — there's a little time remaining.",
    "The gym is in its final minutes of this window — a quick hello is still welcome if you want.",
    "If you can make it over soon, even a brief gym visit could be a nice pick-me-up.",
    "There's just a small pocket of time left, but it's yours if you want a quick visit.",
    "The community center is almost wrapping up, but a spontaneous quick stop is still on the table.",
    "A few minutes at the gym can go a long way — there's still a little window if you're interested.",
    "The gym availability is almost done, but you could still enjoy a quick and fun pop-in today.",
    "If a brief moment of play sounds nice, the gym has just a bit of time left for you.",
    "The window is closing soon, but a quick visit to move and smile is still within reach.",
    "There's a last little opening at the gym — come enjoy a quick moment if the mood strikes.",
    "The gym is nearly done for now, but a brief spontaneous visit could still be a nice experience."
  ],
  "contextual": {
    "Monday": [
      "Monday energy is real — a few minutes of movement can set a wonderful rhythm for the week.",
      "Starting your week with some play time at the gym can make the whole week feel different.",
      "Mondays feel better when you give yourself a little movement — the gym is here if you want.",
      "The community center is a great way to kick off the week with some positive energy today.",
      "A Monday gym visit can turn the start of the week into something you actually look forward to.",
      "If you want to set a nice rhythm for the week, the gym is open and ready for you."
    ],
    "Tuesday": [
      "Tuesdays are great for building on the week's momentum — the gym is open if you want to play.",
      "The community center on a Tuesday can be a nice mid-early-week treat for yourself if you want.",
      "A Tuesday gym session is one of those small things that can make your whole week feel better.",
      "If you want a nice midweek-starter activity, the gym could be a great option for you today.",
      "Tuesday at the gym has a relaxed vibe — a good day to enjoy some movement at your pace.",
      "The community center on a Tuesday often has a nice flow — come enjoy it if you feel like it."
    ],
    "Wednesday": [
      "Happy midweek — the gym could be a nice way to mark the halfway point if you want.",
      "Wednesdays are a great time to recharge at the gym and carry that energy into the rest of the week.",
      "The midweek slump is real, but a visit to the community center can turn it around if you'd like.",
      "A Wednesday gym visit is like a gift to your future Thursday self — if you're in the mood.",
      "You're halfway through the week — the gym is a nice place to celebrate that if you want.",
      "Midweek movement at the community center can be a wonderful little reset for the rest of your week."
    ],
    "Thursday": [
      "Thursdays have a great energy at the gym — the weekend is close and spirits tend to be up.",
      "A Thursday visit to the gym can give you a nice boost heading into the end of the week.",
      "The community center on a Thursday has a fun almost-Friday vibe — come enjoy it if you'd like.",
      "If you want some movement before the weekend arrives, Thursday is a great day to come play.",
      "Thursday gym sessions have a way of making you feel accomplished heading into the weekend ahead.",
      "The gym on a Thursday can be just the thing to carry good energy into your Friday."
    ],
    "Friday": [
      "Happy Friday — what better way to start the weekend than some fun time at the gym if you want?",
      "A Friday gym visit is a great way to transition into weekend mode with some enjoyable movement.",
      "The community center on a Friday has a relaxed, celebratory energy — come soak it up if you'd like.",
      "If you want to kick off your weekend with some play, the gym is a great place to start.",
      "Friday at the gym can feel like a reward — come enjoy some movement to close out the week.",
      "The weekend starts now — and the gym is open if you want to celebrate with some activity."
    ],
    "Saturday": [
      "Saturday at the gym has a special energy — people are relaxed and there to have fun if you want to join.",
      "A Saturday visit to the community center is a great way to enjoy your free time if you feel like it.",
      "Weekends are for doing things you enjoy — if that includes the gym, the door is open for you.",
      "Saturday movement at the gym can make the whole weekend feel more vibrant and energized if you want.",
      "The community center on a Saturday is a fun place to be — come enjoy the weekend vibe.",
      "If you want an enjoyable way to spend part of your Saturday, the gym is waiting for you."
    ],
    "Sunday": [
      "A Sunday gym visit can be a wonderful way to close out the weekend if you're in the mood.",
      "Sunday movement has a reflective, refreshing quality — the gym is open if you want to experience it.",
      "The community center on a Sunday is a nice place to unwind before the new week begins.",
      "If you want to start your Monday feeling great, a Sunday session at the gym can help with that.",
      "Sunday at the gym has a calm, easygoing vibe — come enjoy it if you feel like it.",
      "A relaxed Sunday visit to the community center can be the perfect way to end your weekend."
    ],
    "01-01": [
      "Happy New Year — the gym is a wonderful place to start the year with some joyful movement.",
      "A New Year's visit to the community center can set a beautiful rhythm for the year ahead.",
      "The first day of a new year is a great time to enjoy the gym — no resolutions needed, just fun.",
      "Welcome to the new year — the gym is open and ready to be part of your fresh start."
    ],
    "02-14": [
      "Happy Valentine's Day — showing yourself some love with a gym visit is a beautiful thing today.",
      "Valentine's Day is about love, and that includes loving yourself enough to enjoy some movement if you want.",
      "The gym on Valentine's Day can be a wonderful act of self-care — come enjoy it if you'd like.",
      "A Valentine's Day visit to the community center is a great way to show yourself some appreciation."
    ],
    "05-26": [
      "This Memorial Day, the community center is a great place to enjoy some meaningful movement if you want.",
      "A Memorial Day visit to the gym can be a nice way to honor the day with gratitude and activity.",
      "The gym on Memorial Day has a reflective, appreciative energy — come be part of it if you'd like.",
      "Enjoy your Memorial Day with some time at the community center if that sounds good to you."
    ],
    "07-04": [
      "Happy Fourth of July — the gym is a fun way to celebrate your freedom to move and play.",
      "Independence Day at the community center has a festive energy — come enjoy it if you want to.",
      "A July Fourth gym visit can be a wonderful addition to your holiday celebrations if you're up for it.",
      "Celebrate your independence with some joyful movement at the gym today — the door is open for you."
    ],
    "09-01": [
      "Happy Labor Day — the gym is a great place to enjoy your well-earned day off if you want.",
      "Labor Day at the community center is a nice way to relax and recharge with some movement.",
      "If you want to celebrate Labor Day with some fun activity, the gym is open and welcoming today.",
      "A Labor Day gym visit can be a wonderful way to honor rest and recreation at the same time."
    ],
    "11-27": [
      "Happy Thanksgiving — the gym is open if you want to enjoy some grateful, joyful movement today.",
      "A Thanksgiving visit to the community center can be a wonderful way to celebrate feeling good today.",
      "The gym on Thanksgiving has a warm, appreciative vibe — come enjoy it if you feel like it.",
      "If you want to add some fun movement to your Thanksgiving, the community center is here for you."
    ],
    "12-25": [
      "Merry Christmas — the gym is a lovely place to enjoy some holiday movement if you want to.",
      "A Christmas Day visit to the community center can be a wonderful gift to yourself this holiday.",
      "The gym on Christmas has a special, festive energy — come enjoy some joyful movement if you'd like.",
      "If you want to add some playful activity to your Christmas, the community center welcomes you warmly."
    ],
    "spring": [
      "Spring energy and gym time go perfectly together — come enjoy the fresh, renewed vibe if you want.",
      "The spring air and a gym visit make a wonderful combination — your body might appreciate the movement.",
      "Something about spring makes movement feel extra good — the gym is ready if you want to feel it.",
      "Spring is a season of renewal — a visit to the community center can be part of that feeling.",
      "The gym in spring has an energizing quality — come soak up that fresh seasonal vibe if you'd like.",
      "If the spring weather has you feeling alive, the gym is a great place to channel that energy."
    ],
    "summer": [
      "Summer and the gym go great together — come enjoy some indoor activity in the cool space if you want.",
      "The community center is a wonderful summer hangout — come enjoy the air conditioning and some fun movement.",
      "Summer days are perfect for a gym visit — cool off inside and get some enjoyable activity in.",
      "If you want a break from the summer heat, the gym is a refreshing place to move and play.",
      "The gym in summer is a cool, welcoming escape — come enjoy some indoor fun if you feel like it.",
      "Summer vibes at the community center are always good — come be part of the seasonal fun today."
    ],
    "fall": [
      "Fall energy and gym time are a perfect match — come enjoy the crisp, motivated vibe if you want.",
      "The autumn air outside and movement inside make a wonderful combination — the gym is here for you.",
      "Something about fall makes a gym visit feel especially cozy and satisfying — come try it if you'd like.",
      "Fall is a great season for the gym — the energy feels focused and refreshed if you want to enjoy it.",
      "The community center in fall has a warm, inviting quality — come enjoy some movement in the crisp season.",
      "If the fall weather has you feeling energized, the gym is a perfect place to enjoy that feeling."
    ],
    "winter": [
      "The gym is a wonderful warm escape on a winter day — come enjoy some cozy indoor movement.",
      "Winter days feel brighter with a little movement — the community center is warm and welcoming if you want.",
      "When it's cold outside, the gym is a perfect place to warm up with some fun activity inside.",
      "A winter gym visit can chase away the chill and leave you feeling warm and energized inside.",
      "The community center is a cozy winter retreat — come enjoy some indoor movement if you feel like it.",
      "Winter can feel long, but a visit to the gym can make the day feel shorter and brighter."
    ]
  }
}